## Pizza Sales Exploratory Data Analysis

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# create path to csvs
path = 'pizza_store_tables'

### Orders Table EDA

In [5]:
# read in orders table
order_path = os.path.join(path,'orders.csv')
order_path
orders_df = pd.read_csv(order_path)
orders_df.head()

   order_id        date      time
0         1  2015-01-01  11:38:36
1         2  2015-01-01  11:57:40
2         3  2015-01-01  12:12:28
3         4  2015-01-01  12:16:31
4         5  2015-01-01  12:21:30

In [6]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21350 entries, 0 to 21349
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  21350 non-null  int64
 1   date      21350 non-null  object
 2   time      21350 non-null  object
dtypes: int64(1), object(2)
memory usage: 500.5+ KB

In [4]:
# no nulls, check for duplicate order_ids
orders_df['order_id'].nunique()

21350

### Order Details table EDA

In [12]:
# read in order_details table
order_details_path = os.path.join(path,'order_details.csv')
order_details_df = pd.read_csv(order_details_path)
order_details_df.head()

   order_details_id  order_id       pizza_id  quantity
0                 1         1     hawaiian_m         1
1                 2         2  classic_dlx_m         1
2                 3         2  five_cheese_l         1
3                 4         2    ital_supr_l         1
4                 5         2     mexicana_m         1

In [13]:
order_details_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48620 entries, 0 to 48619
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_details_id  48620 non-null  int64
 1   order_id          48620 non-null  int64
 2   pizza_id          48620 non-null  object
 3   quantity          48620 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [17]:
order_details_df.nunique()

order_details_id    48620
order_id            21350
pizza_id               91
quantity                4
dtype: int64

In [9]:
# combine date and time and convert to date time
orders_df['order_date'] = orders_df['date'] + ' ' + orders_df['time']
orders_df['order_date'] = pd.to_datetime(orders_df['order_date'])
orders_df.drop(columns=['date','time'],inplace = True)
orders_df.head()

   order_id          order_date
0         1 2015-01-01 11:38:36
1         2 2015-01-01 11:57:40
2         3 2015-01-01 12:12:28
3         4 2015-01-01 12:16:31
4         5 2015-01-01 12:21:30

In [10]:
monthly_orders_df = orders_df.resample(rule='M', on = 'order_date')['order_id'].count()
monthly_orders_df

order_date
2015-01-31    1845
2015-02-28    1685
2015-03-31    1840
2015-04-30    1799
2015-05-31    1853
2015-06-30    1773
2015-07-31    1935
2015-08-31    1841
2015-09-30    1661
2015-10-31    1646
2015-11-30    1792
2015-12-31    1680
Freq: M, Name: order_id, dtype: int64